SGLang_Data_20260611_using)_flush_cache/non_pd_dp2_sweep_20260611/sglang-oai_nonpd_dp2_rr2_il256_ol128.log
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=32102, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=2.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/non_pd_dp2_sweep_20260611/sglang-oai_nonpd_dp2_rr2_il256_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=32102, dataset_name='random', dataset_path='', model='/mnt/nfs02/users/tjiang/Gitrepo/models/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=200, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=256, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=2.0, use_trace_timestamps=False, max_concurrency=None, output_file='/mnt/nfs02/users/tjiang/Gitrepo/sglang/non_pd_dp2_sweep_20260611/sglang-oai_nonpd_dp2_rr2_il256_ol128.jsonl', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, seed=42, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 26096
#Output tokens: 13323
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    2.0       
Max request concurrency:                 not set   
Successful requests:                     200       
Benchmark duration (s):                  99.17     
Total input tokens:                      26096     
Total input text tokens:                 26096     
Total input vision tokens:               0         
Total generated tokens:                  13323     
Total generated tokens (retokenized):    13321     
Request throughput (req/s):              2.02      
Input token throughput (tok/s):          263.15    
Output token throughput (tok/s):         134.35    
Peak output token throughput (tok/s):    393.00    
Peak concurrent requests:                9         
Total token throughput (tok/s):          397.50    
Concurrency:                             1.59      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   788.98    
Median E2E Latency (ms):                 796.57    
---------------Time to First Token----------------
Mean TTFT (ms):                          30.83     
Median TTFT (ms):                        28.13     
P99 TTFT (ms):                           48.10     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          11.53     
Median TPOT (ms):                        11.50     
P99 TPOT (ms):                           12.29     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           11.56     
Median ITL (ms):                         11.38     
P95 ITL (ms):                            11.91     
P99 ITL (ms):                            18.43     
Max ITL (ms):                            27.73     
==================================================